In [57]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [58]:
#buatkolom 5
n_rows = 5

#buatbaris 
n_cols = 2

#judul kolom
cols = ['omset','operasional']

#membuat data frame dengan bilangan random integer dari angka 1 sampai 20 yang diisi didalam kolom rows dan cols
df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                    columns=cols)
df

   omset  operasional
0      7           11
1     16           13
2     19           17
3      8           18
4     12           12

In [59]:
#mengubah dataframe dengan pengalian data
#fungsi (_) atau underscore itu untuk membuat karakter rupiah (angka ribuan belakang koma)
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0   700000       110000
1  1600000       130000
2  1900000       170000
3   800000       180000
4  1200000       120000

In [60]:
#membuat kolom baru berupa tanggal dengan fungsi makedateindex dengan freq = 'D' yang artinya formatnya hari
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index': 'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01   700000       110000
1 2000-01-02  1600000       130000
2 2000-01-03  1900000       170000
3 2000-01-04   800000       180000
4 2000-01-05  1200000       120000

In [61]:
#malkukan formatting tampilan data frame
#2.f menambahkan 2 digit angka dibelakang koma
formatku = {'tanggal' : '{:%d/%m/%Y}',
            'operasional' : 'Rp {:.2f}',
            'omset' : 'Rp {:.2f}'}
laporan = df.style.format(formatku)
laporan

In [63]:
#format laporan itu berupa styler bukan dataframe

type(laporan)

pandas.io.formats.style.Styler

In [64]:
#berfungsi untuk menyembunyikan index dataframe
laporan.hide_index()

In [65]:
#set_caption berfungsi menambahkan judul
laporan.set_caption('Data omset dan Operasional')

In [68]:
#highlight_min berfungsi memberikan warna pada baris dengan nilai minimum
#highlight_max berfungsi memberikan warna pada baris dengan nilai maximum
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')